In [2]:
import pandas as pd
import numpy as np

In [2]:
account_info = pd.DataFrame({

"name": ["Bob", "Mary", "Mita"],

"account": [123846, 123972, 347209],

"balance": [123, 3972, 7209],

})

In [3]:
account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [4]:
account_info["name"]

0     Bob
1    Mary
2    Mita
Name: name, dtype: object

In [5]:
account_info["name"] = ["Smith", "Jane", "Patel"]

In [5]:
account_info

    name  account  balance
0  Smith   123846      123
1   Jane   123972     3972
2  Patel   347209     7209

In [6]:
account_info = pd.DataFrame({

"name": ["Bob", "Mary", "Mita"],

"account": [123846, 123972, 347209],

"balance": [123, 3972, 7209],

})

In [7]:
account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [8]:
account_info[["name", "balance"]]

   name  balance
0   Bob      123
1  Mary     3972
2  Mita     7209

In [9]:
account_info = pd.DataFrame({

"name": ["Bob", "Mary", "Mita"],

"account": [123846, 123972, 347209],

"balance": [123, 3972, 7209],

})

In [10]:
account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [11]:
account_info.iloc[0]

name          Bob
account    123846
balance       123
Name: 0, dtype: object

In [12]:
account_info.iloc[1]

name         Mary
account    123972
balance      3972
Name: 1, dtype: object

In [13]:
 account_info.iloc[0:2]

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972

In [14]:
account_info.iloc[:]

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [15]:
 account_info = pd.DataFrame({

"name": ["Bob", "Mary", "Mita"],

"account": [123846, 123972, 347209],

"balance": [123, 3972, 7209],

})
 account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [16]:
account_info.iloc[1, 2]

3972

In [17]:
account_info.iloc[:, [0, 2]]

   name  balance
0   Bob      123
1  Mary     3972
2  Mita     7209

In [18]:
account_info = pd.DataFrame({

"name": ["Bob", "Mary", "Mita"],

"account": [123846, 123972, 347209],

"balance": [123, 3972, 7209],

})
account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [19]:
account_info.iloc[account_info.index % 2 == 1]

   name  account  balance
1  Mary   123972     3972

In [20]:
 account_info = pd.DataFrame({

"name": ["Bob", "Mary", "Mita"],

"account": [123846, 123972, 347209],

"balance": [123, 3972, 7209],

})
 account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [21]:
account_info.loc[1, "balance"]

3972

In [22]:
account_info.loc[:, ["name", "balance"]]

   name  balance
0   Bob      123
1  Mary     3972
2  Mita     7209

In [23]:
building_records_1844 = pd.read_clipboard()
building_records_1844 = building_records_1844.set_index('building')
building_records_1844

                established
building
Grande Hotel           1830
Jone's Farm            1842
Public Library         1836
Marietta House         1823

In [24]:
building_records_2020 = pd.read_clipboard()
building_records_2020 = building_records_2020.set_index('building')
building_records_2020

                    established
building
Sam's Bakery               1962
Grande Hotel               1830
Public Library             1836
Mayberry's Factory         1924

In [25]:
cols = building_records_2020.columns.difference(building_records_1844.columns)
cols

Index([], dtype='object')

In [26]:
building_records_2020[[]]

Empty DataFrame
Columns: []
Index: [Sam's Bakery, Grande Hotel, Public Library, Mayberry's Factory]

In [27]:
building_records_2020[cols]

Empty DataFrame
Columns: []
Index: [Sam's Bakery, Grande Hotel, Public Library, Mayberry's Factory]

In [28]:
pd.merge(building_records_1844,building_records_2020[cols],how='inner',on=["building"],)

                established
building
Grande Hotel           1830
Public Library         1836

In [41]:
pd.merge(building_records_1844,building_records_2020,how='inner',on=["building"],)

                established_x  established_y
building
Grande Hotel             1830           1830
Public Library           1836           1836

In [43]:
gene_group1 = pd.read_clipboard()
gene_group1 = gene_group1.set_index('id')
gene_group1

       FC1    P1
id
Myc      2  0.05
BRCA1    3  0.01
BRCA2    8  0.02

In [45]:
gene_group2 = pd.read_clipboard()
gene_group2 = gene_group2.set_index('id')
gene_group2

        FC2    P2
id
Myc       2  0.05
BRCA1     3  0.01
Notch1    2  0.03
BRCA2     8  0.02

In [46]:
pd.merge(
 gene_group1,
 gene_group2,
 how='outer',
 on=["id"],
)

        FC1    P1  FC2    P2
id
Myc     2.0  0.05    2  0.05
BRCA1   3.0  0.01    3  0.01
BRCA2   8.0  0.02    8  0.02
Notch1  NaN   NaN    2  0.03

In [47]:
building_records_1844 = pd.read_clipboard()
building_records_1844 = building_records_1844.set_index('building')
building_records_1844

                established
building
Grande Hotel           1832
Jone's Farm            1842
Public Library         1836
Marietta House         1823

In [49]:
merged_records = pd.merge(
building_records_2020,
building_records_1844,
how='left',
right_on="building",
left_on="building",
suffixes=("_2000", ""),
)
merged_records

                    established_2000  established
building
Sam's Bakery                    1962          NaN
Grande Hotel                    1830       1832.0
Public Library                  1836       1836.0
Mayberry's Factory              1924          NaN

In [50]:
merged_records["established"].fillna(
merged_records["established_2000"],
inplace=True,
)
merged_records

                    established_2000  established
building
Sam's Bakery                    1962       1962.0
Grande Hotel                    1830       1832.0
Public Library                  1836       1836.0
Mayberry's Factory              1924       1924.0

In [51]:
del merged_records["established_2000"]
merged_records

                    established
building
Sam's Bakery             1962.0
Grande Hotel             1832.0
Public Library           1836.0
Mayberry's Factory       1924.0

In [53]:
trial_a_records = pd.read_clipboard()
trial_a_records = trial_a_records.set_index('patient')
trial_a_records

              name
patient
230858        John
237340         May
240932   Catherine
124093       Ahmed

In [52]:
trial_b_records = pd.read_clipboard()
trial_b_records = trial_b_records.set_index('patient')
trial_b_records

              name
patient
210858         Abi
237340         May
240932   Catherine
154093       Julia

In [69]:
cols = trial_b_records.columns.difference(trial_a_records.columns)

In [78]:
both_trials = pd.merge(
trial_a_records,
trial_b_records,
how='outer',
indicator=True,
right_index=True,
left_index=True,
# on = 'name'
  
)
both_trials

            name_x     name_y      _merge
patient
124093       Ahmed        NaN   left_only
154093         NaN      Julia  right_only
210858         NaN        Abi  right_only
230858        John        NaN   left_only
237340         May        May        both
240932   Catherine  Catherine        both

In [79]:
both_trials.name_x = both_trials.name_x.fillna(both_trials.name_y)
both_trials

            name_x     name_y      _merge
patient
124093       Ahmed        NaN   left_only
154093       Julia      Julia  right_only
210858         Abi        Abi  right_only
230858        John        NaN   left_only
237340         May        May        both
240932   Catherine  Catherine        both

In [83]:
both_trials = both_trials.drop('name_y',1)

C:\temp\ipykernel_25308\3612635325.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  both_trials = both_trials.drop('name_y',1)

KeyError: "['name_y'] not found in axis"

In [86]:
both_trials.columns = ['name','_merge']
both_trials

              name      _merge
patient
124093       Ahmed   left_only
154093       Julia  right_only
210858         Abi  right_only
230858        John   left_only
237340         May        both
240932   Catherine        both

In [87]:
both_trials.query('_merge != "both"').drop('_merge', 1)

C:\temp\ipykernel_25308\3819494092.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  both_trials.query('_merge != "both"').drop('_merge', 1)

          name
patient
124093   Ahmed
154093   Julia
210858     Abi
230858    John

In [88]:
both_trials = both_trials.query('_merge != "both"').drop('_merge', 1)
both_trials

C:\temp\ipykernel_25308\2738160063.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  both_trials = both_trials.query('_merge != "both"').drop('_merge', 1)

          name
patient
124093   Ahmed
154093   Julia
210858     Abi
230858    John

In [90]:
building_records_1844 = pd.read_clipboard()
building_records_1844 = building_records_1844.set_index(['building','location'])
building_records_1844

                         established
building       location
Grande Hotel   (4,5)            1831
Jone's Farm    (1,2)            1842
Public Library (6,4)            1836
Marietta House (1,7)            1823

In [94]:
building_records_2020 = pd.read_clipboard()
building_records_2020 = building_records_2020.set_index(['building','location'])
building_records_2020

                             established
building           location
Sam's Bakery       (5,1)            1962
Grande Hotel       (4,5)            1830
Public Library     (6,4)            1835
Mayberry's Factory (3,2)            1924

In [95]:
building_records_1844.join(
building_records_2020,
how='inner',
rsuffix="_2020",
)

                         established  established_2020
building       location
Grande Hotel   (4,5)            1831              1830
Public Library (6,4)            1836              1835

In [96]:
temp_county_a = pd.read_clipboard()
temp_county_a = temp_county_a.set_index('location')
temp_county_a

          temp
location
(4,5)     35.6
(1,2)     37.4
(6,4)     36.3
(1,7)     40.2

In [97]:
temp_county_b = pd.read_clipboard()
temp_county_b = temp_county_b.set_index('location')
temp_county_b

          temp
location
(6,4)     34.2
(0,4)     33.7
(3,8)     38.1
(1,5)     37.0

In [98]:
pd.concat([temp_county_a, temp_county_b])

          temp
location
(4,5)     35.6
(1,2)     37.4
(6,4)     36.3
(1,7)     40.2
(6,4)     34.2
(0,4)     33.7
(3,8)     38.1
(1,5)     37.0

In [99]:
temp_device_a = pd.read_clipboard()
temp_device_a = temp_device_a.set_index('location')
temp_device_a

          temp
location
(4,5)     35.6
(1,2)     37.4
(6,4)     36.3
(1,7)     40.2

In [102]:
temp_device_b = pd.read_clipboard()
temp_device_b = temp_device_b.set_index('location')
temp_device_b

          temp
location
(4,5)     34.2
(1,2)     36.7
(6,4)     37.1
(1,7)     39.0

In [103]:
pd.concat(
[temp_device_a, temp_device_b],
keys=["device_a", "device_b"],  #
axis=1,
)

         device_a device_b
             temp     temp
location
(4,5)        35.6     34.2
(1,2)        37.4     36.7
(6,4)        36.3     37.1
(1,7)        40.2     39.0

In [106]:
import pandas as pd
def grade(values):
    if 70 <= values["score"] < 80:
        values["score"] = "C"
    elif 80 <= values["score"] < 90:
        values["score"] = "B"
    elif 90 <= values["score"]:
        values["score"] = "A"
    else:
        values["score"] = "F"
    return values
scores = pd.DataFrame(
{"score": [89, 70, 71, 65, 30, 93, 100, 75]}
)
scores.apply(grade, axis=1)

  score
0     B
1     C
2     C
3     F
4     F
5     A
6     A
7     C

In [107]:
import pandas as pd
restaurant_inspections = pd.DataFrame({
"restaurant": ["Diner","Diner","Pandas","Pandas"],
"location": [(4,2),(4,2),(5,4),(5,4)],
"date": ["02/18","05/18","04/18","01/18"],
    "score": [90,100,55,60]})
restaurant_inspections

  restaurant location   date  score
0      Diner   (4, 2)  02/18     90
1      Diner   (4, 2)  05/18    100
2     Pandas   (5, 4)  04/18     55
3     Pandas   (5, 4)  01/18     60

In [108]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
    ("Diner", (4,2)),
("Pandas", (5,4)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"]
)
restaurants

MultiIndex([( 'Diner', (4, 2)),
            ( 'Diner', (4, 2)),
            ('Pandas', (5, 4)),
            ('Pandas', (5, 4))],
           names=['restaurant', 'location'])

In [109]:
restaurant_inspections = pd.DataFrame(
{
"date": ["02/18", "05/18", "04/18", "01/18"],
"score": [90, 100, 55, 76],
},
index=restaurants,
)
restaurant_inspections

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    04/18     55
           (5, 4)    01/18     76

In [110]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Pandas", (5,4)),
),
    names = ["restaurant", "location"]
)
inspections = pd.MultiIndex.from_tuples(
(
(0, "score"),
(0, "date"),
(1, "score"),
(1, "date"),
),
names=["inspection", None],
)
restaurant_inspections = pd.DataFrame(
[[90, "02/18", 100, "05/18"], [55, "04/18", 76, "01/18"]],
index=restaurants,
columns=inspections,
)
restaurant_inspections

inspection              0            1
                    score   date score   date
restaurant location
Diner      (4, 2)      90  02/18   100  05/18
Pandas     (5, 4)      55  04/18    76  01/18

In [111]:
import pandas as pd
restaurant_inspections = pd.DataFrame({
"restaurant": ["Diner","Diner","Pandas","Pandas"],
"location": [(4,2),(4,2),(5,4),(5,4)],
"date": ["02/18","05/18","02/18","05/18"],
"score": [90,100,55,60]})
restaurant_inspections

  restaurant location   date  score
0      Diner   (4, 2)  02/18     90
1      Diner   (4, 2)  05/18    100
2     Pandas   (5, 4)  02/18     55
3     Pandas   (5, 4)  05/18     60

In [112]:
total_inspections = restaurant_inspections.groupby(
["restaurant", "location"], as_index=False,
)["score"].count()
total_inspections

  restaurant location  score
0      Diner   (4, 2)      2
1     Pandas   (5, 4)      2

In [113]:
total_inspections.rename(
columns={"score": "total"}, inplace=True
)
total_inspections

  restaurant location  total
0      Diner   (4, 2)      2
1     Pandas   (5, 4)      2

In [114]:
restaurant_inspections = pd.merge(
restaurant_inspections,
total_inspections,
how="outer",
)
restaurant_inspections

  restaurant location   date  score  total
0      Diner   (4, 2)  02/18     90      2
1      Diner   (4, 2)  05/18    100      2
2     Pandas   (5, 4)  02/18     55      2
3     Pandas   (5, 4)  05/18     60      2

In [115]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Diner", (4,2)),
("Pandas", (5,4)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"],
)
restaurant_inspections = pd.DataFrame(
{
"date": ["02/18", "05/18", "02/18", "05/18"],
"score": [90, 100, 55, 76],
},
index=restaurants,
)
restaurant_inspections

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    02/18     55
           (5, 4)    05/18     76

In [116]:
restaurant_inspections["total"] = \
restaurant_inspections["score"].groupby(
["restaurant","location"],
).count()
restaurant_inspections

                      date  score  total
restaurant location
Diner      (4, 2)    02/18     90      2
           (4, 2)    05/18    100      2
Pandas     (5, 4)    02/18     55      2
           (5, 4)    05/18     76      2

In [117]:
restaurant_inspections.set_index(
["total"],
append=True,
inplace=True,
)
restaurant_inspections

                            date  score
restaurant location total
Diner      (4, 2)   2      02/18     90
                    2      05/18    100
Pandas     (5, 4)   2      02/18     55
                    2      05/18     76

In [119]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"],
)
restaurant_inspections = pd.DataFrame(
{
"02/18": [90, 55],
"05/18": [100, 76],
},
index=restaurants,
)
restaurant_inspections

                     02/18  05/18
restaurant location
Diner      (4, 2)       90    100
Pandas     (5, 4)       55     76

In [120]:
restaurant_inspections["total"] = \
restaurant_inspections.count(axis=1)
restaurant_inspections.set_index(
["total"],
append=True,
inplace=True,
)
restaurant_inspections

                           02/18  05/18
restaurant location total
Diner      (4, 2)   2         90    100
Pandas     (5, 4)   2         55     76

In [125]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"]
)
inspections = pd.MultiIndex.from_tuples(
(
(0, "score"),
(0, "date"),
(1, "score"),
(1, "date"),
),
names=["inspection", "data"],
)
inspections

MultiIndex([(0, 'score'),
            (0,  'date'),
            (1, 'score'),
            (1,  'date')],
           names=['inspection', 'data'])

In [130]:
restaurant_inspections = pd.DataFrame(
[[90, "02/18", 100,"05/18"], [55, "04/18", 76,"01/18"]],
index=restaurants,
columns=inspections,
)
restaurant_inspections

inspection              0            1
data                score   date score   date
restaurant location
Diner      (4, 2)      90  02/18   100  05/18
Pandas     (5, 4)      55  04/18    76  01/18

In [132]:
total = \
restaurant_inspections.iloc[
:,
restaurant_inspections.columns.get_level_values("data") \
== "score"
].count()
total

inspection  data
0           score    2
1           score    2
dtype: int64

In [133]:
new_index = pd.DataFrame(
total.values,
columns=["total"],
index=restaurant_inspections.index,
)
new_index

                     total
restaurant location
Diner      (4, 2)        2
Pandas     (5, 4)        2

In [134]:
new_index.set_index("total", append=True, inplace=True)

In [135]:
new_index

Empty DataFrame
Columns: []
Index: [(Diner, (4, 2), 2), (Pandas, (5, 4), 2)]

In [136]:
restaurant_inspections.index = new_index.index

In [137]:
restaurant_inspections

inspection                    0            1
data                      score   date score   date
restaurant location total
Diner      (4, 2)   2        90  02/18   100  05/18
Pandas     (5, 4)   2        55  04/18    76  01/18

In [138]:
df = pd.read_clipboard()
df

  restaurant location   date  score
0      Diner    (4,2)  218     90
1     Pandas    (5,4)  418     55
2      Diner    (4,2)  518    100
3     Pandas    (5,4)  118     76

In [140]:
import numpy as np
df = df.pivot_table(
values=['score'],
index=["restaurant","location"],
aggfunc=np.mean
)
df

                     score
restaurant location
Diner      (4,2)      95.0
Pandas     (5,4)      65.5

In [141]:
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Diner", (4,2)),
("Pandas", (5,4)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"],
)
df = pd.DataFrame(
{
"date": ["02/18", "05/18", "02/18", "05/18"],
"score": [90, 100, 55, 76],
},
index=restaurants,
)
df

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    02/18     55
           (5, 4)    05/18     76

In [142]:
df1 = df[["score"]].groupby(["restaurant","location"]).mean()
df1

                     score
restaurant location
Diner      (4, 2)     95.0
Pandas     (5, 4)     65.5

In [144]:
df = pd.read_clipboard()
df

    date  tumor_size  drug  dose
0  02/18          90  1384    10
1  02/25          80  1384    10
2  03/07          65  1384    10
3  03/21          60  1384    10
4  02/18          30  1389     7
5  02/25          20  1389     7
6  03/07          25  1389    10
7  03/21          25  1389     7

In [145]:
df.pivot(
index="drug",
columns="date",
values="tumor_size"
)

date  02/18  02/25  03/07  03/21
drug
1384     90     80     65     60
1389     30     20     25     25

In [146]:
df = pd.read_clipboard()
df

    date  tumor_size  drug  dose
0  02/18          90  1384    10
1  02/25          80  1384    10
2  03/07          65  1384    10
3  03/21          60  1384    10
4  02/18          30  1389     7
5  02/25          20  1389     7
6  02/25          25  1389     7
7  03/07          25  1389     7

In [148]:
df.pivot(
index = 'drug',
columns = 'date',
values = 'tumor_size',
)

ValueError: Index contains duplicate entries, cannot reshape

In [150]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"]
)
inspections = pd.MultiIndex.from_tuples(
(
(0, "score"),
(1, "score"),

),
names=["inspection", ""],
)
df = pd.DataFrame(
[[90, 100], [55, 76]],
index=restaurants,
columns=inspections,
)
df

inspection              0     1
                    score score
restaurant location
Diner      (4, 2)      90   100
Pandas     (5, 4)      55    76

In [151]:
df = df.stack().reset_index()
df

inspection restaurant location          0    1
0               Diner   (4, 2)  score  90  100
1              Pandas   (5, 4)  score  55   76

In [152]:
import pandas as pd
restaurants = pd.MultiIndex.from_tuples(
(
("Diner", (4,2)),
("Pandas", (5,4)),
),
names = ["restaurant", "location"]
)
inspections = pd.MultiIndex.from_tuples(
(
(0, "score"),
(0, "date"),
(1, "score"),
(1, "date"),
),
names=["inspection", "data"],
)
df = pd.DataFrame(
[[90, "02/18", 100,"05/18"], [55, "04/18", 76,"01/18"]],
index=restaurants,
columns=inspections,
)
df

inspection              0            1
data                score   date score   date
restaurant location
Diner      (4, 2)      90  02/18   100  05/18
Pandas     (5, 4)      55  04/18    76  01/18

In [153]:
df.stack().reset_index()

inspection restaurant location   data      0      1
0               Diner   (4, 2)   date  02/18  05/18
1               Diner   (4, 2)  score     90    100
2              Pandas   (5, 4)   date  04/18  01/18
3              Pandas   (5, 4)  score     55     76

In [2]:
df = pd.DataFrame([[4, 9],[6, 7]], columns=['A', 'B'])
df

   A  B
0  4  9
1  6  7

In [4]:
df.apply(np.sum,axis = 1)

0    13
1    13
dtype: int64

In [5]:
results = [0]*len(df)
results

[0, 0]

In [9]:
for i,v in df.iterrows():
    results[i] = v.sum()
df['sum'] = results
df

   A  B  sum
0  4  9   13
1  6  7   13

In [12]:
df = pd.read_clipboard()
df

     A   B   C
0  NaN   3   2
1  2.0   1   5
2  NaN   6   8
3  NaN  99  15

In [13]:
def replace_missing(series):
    if np.isnan(series['A']):
        series['A'] = max(series['B'],series['C'])
    return series
df1 = df.apply(replace_missing,axis = 1)
df1

      A     B     C
0   3.0   3.0   2.0
1   2.0   1.0   5.0
2   8.0   6.0   8.0
3  99.0  99.0  15.0

In [14]:
df['A'].where(
~df['A'].isna(),
df[['B','C']].max(axis = 1),
inplace = True)
df

      A   B   C
0   3.0   3   2
1   2.0   1   5
2   8.0   6   8
3  99.0  99  15

In [4]:
def test_fruit_in_order(series):
    if series['fruit'].lower() in series['order'].lower():
        return series
    else :
        return np.nan

In [3]:
data = pd.DataFrame({
    'fruit':['orange','lemon','mango'],
    'order':["I'd like an orange","Mango","May I have a mango"]
})
data

    fruit               order
0  orange  I'd like an orange
1   lemon               Mango
2   mango  May I have a mango

In [5]:
data.apply(test_fruit_in_order,result_type = 'reduce',axis = 1).dropna()  #,result_type = 'reduce'   #.dropna()

    fruit               order
0  orange  I'd like an orange
2   mango  May I have a mango

In [20]:
data

    fruit               order
0  orange  I'd like an orange
1   lemon               Mango
2   mango  May I have a mango

In [23]:
#apply
mask = [fruit.lower() in order.lower()
       for (fruit,order) in data[['fruit','order']].values]
mask

[True, False, True]

In [24]:
data1 = data[mask]
data1

    fruit               order
0  orange  I'd like an orange
2   mango  May I have a mango

In [26]:
mask = [fruit.lower() in order.lower()
       for fruit,order  in data[['fruit','order']].values]
mask

[True, False, True]

In [29]:
def percentileofscore(a, score):
    

    """
    Three-quarters of the given values lie below a given score:
    >>> stats.percentileofscore([1, 2, 3, 4], 3)
    75.0
    With multiple matches, note how the scores of the two
    matches, 0.6 and 0.8 respectively, are averaged:
    >>> stats.percentileofscore([1, 2, 3, 3, 4], 3)
    70.0
    """

    n = len(a)
    left = np.count_nonzero(a < score)
    right = np.count_nonzero(a <= score)
    pct = (right + left + (1 if right > left else 0)) * 50.0/n
    return pct

In [42]:
data = pd.DataFrame(np.arange(20).reshape(4,5))
data

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [32]:
from scipy import stats
def apply_percentileofscore(series):
    return series.apply(
    lambda x:stats.percentileofscore(series,x)
    )

In [33]:
data.apply(apply_percentileofscore,axis = 1)

      0     1     2     3      4
0  20.0  40.0  60.0  80.0  100.0
1  20.0  40.0  60.0  80.0  100.0
2  20.0  40.0  60.0  80.0  100.0
3  20.0  40.0  60.0  80.0  100.0

In [34]:
def percentileofscore(df):
    res_df = pd.DataFrame({})
    for col in df.columns:
        score = pd.DataFrame([df[col]]*5, index=df.columns).T
        left = df[df < score].count(axis=1)
        right = df[df <= score].count(axis=1)
        right_is_greater = (
        df[df <= score].count(axis=1)
        > df[df < score].count(axis=1)
        ).astype(int)
        res_df[f'res{col}'] = (
left + right + right_is_greater
) * 50.0 / len(df.columns)
    return res_df
percentileofscore(data)

   res0  res1  res2  res3   res4
0  20.0  40.0  60.0  80.0  100.0
1  20.0  40.0  60.0  80.0  100.0
2  20.0  40.0  60.0  80.0  100.0
3  20.0  40.0  60.0  80.0  100.0

In [35]:
data

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [44]:
for col in data.columns:
    print(col)
    score = pd.DataFrame([data[col]]*5, index=data.columns).T
    print(score)

0
    0   1   2   3   4
0   0   0   0   0   0
1   5   5   5   5   5
2  10  10  10  10  10
3  15  15  15  15  15
1
    0   1   2   3   4
0   1   1   1   1   1
1   6   6   6   6   6
2  11  11  11  11  11
3  16  16  16  16  16
2
    0   1   2   3   4
0   2   2   2   2   2
1   7   7   7   7   7
2  12  12  12  12  12
3  17  17  17  17  17
3
    0   1   2   3   4
0   3   3   3   3   3
1   8   8   8   8   8
2  13  13  13  13  13
3  18  18  18  18  18
4
    0   1   2   3   4
0   4   4   4   4   4
1   9   9   9   9   9
2  14  14  14  14  14
3  19  19  19  19  19

In [55]:
arrivals_by_destination = pd.read_clipboard()
arrivals_by_destination = arrivals_by_destination.set_index(['date','place'])
arrivals_by_destination

            number
date place
2015 LON        10
     BER        20
     LON         5
2016 LON        10
     BER        15
     BER        10

In [49]:
arrivals_by_destination.iloc[1,:]

number    20
Name: (2015, BER), dtype: int64

In [51]:
groups = arrivals_by_destination.groupby(['date','place'])

In [52]:
for idx,grp in groups:
    arrivals_by_destination.loc[idx,'total'] = \
    grp['number'].sum()

C:\temp\ipykernel_18264\2632998598.py:2: PerformanceWarning: indexing past lexsort depth may impact performance.
  arrivals_by_destination.loc[idx,'total'] = \
C:\temp\ipykernel_18264\2632998598.py:2: PerformanceWarning: indexing past lexsort depth may impact performance.
  arrivals_by_destination.loc[idx,'total'] = \

In [53]:
arrivals_by_destination

            number  total
date place
2015 LON        10   15.0
     BER        20   20.0
     LON         5   15.0
2016 LON        10   10.0
     BER        15   25.0
     BER        10   25.0

In [56]:
arrivals_by_destination['total'] = \
arrivals_by_destination.groupby(['date','place']).sum()
arrivals_by_destination

            number  total
date place
2015 LON        10     15
     BER        20     20
     LON         5     15
2016 LON        10     10
     BER        15     25
     BER        10     25

In [58]:
#pandas syntax with NumExpr
import pandas as pd
import numpy as np
import numexpr as ne
nrows, ncols = 1000000, 1
df1, df2, df3, df4 = [pd.DataFrame(
np.random.randn(nrows, ncols)) for _ in range(4)]
# Calculate the sum using normal syntax.
df_sum1 = df1 + df2 + df3 + df4
df_sum1

               0
0      -2.691572
1      -2.267331
2       5.635297
3      -2.607891
4       2.989828
...          ...
999995 -1.425251
999996 -0.019539
999997 -0.008962
999998 -0.266766
999999  1.669193

[1000000 rows x 1 columns]

In [59]:
# Calculate the sum using eval so that NumExpr optimizes it.
df_sum2 = pd.eval("df1 + df2 + df3 + df4")
df_sum2

               0
0      -2.691572
1      -2.267331
2       5.635297
3      -2.607891
4       2.989828
...          ...
999995 -1.425251
999996 -0.019539
999997 -0.008962
999998 -0.266766
999999  1.669193

[1000000 rows x 1 columns]

In [60]:
# Calculate the sum using NumExpr directly.
a1, a2, a3, a4 = (
df1.to_numpy(), df2.to_numpy(),
df3.to_numpy(), df4.to_numpy()
)
df_sum3 = ne.evaluate("a1 + a2 + a3 + a4")
df_sum3

array([[-2.69157163],
       [-2.2673309 ],
       [ 5.63529724],
       ...,
       [-0.00896169],
       [-0.26676585],
       [ 1.66919264]])

In [63]:
import io
data = io.StringIO(
"""
id,age,height,weight
129237,32,5.4,126
123083,20,6.1,
123087,25,4.5,unknown
"""
)

In [65]:
df = pd.read_csv(
data,
dtype={
'id': np.int32,
'age': np.int8,
'height': np.float16,
'weight': pd.Int16Dtype()},
na_values=["unknown"],
index_col=[0],
)
df

        age    height  weight
id
129237   32  5.398438     126
123083   20  6.101562    <NA>
123087   25  4.500000    <NA>

In [66]:
df.memory_usage(deep=True)

Index     24
age        3
height     6
weight     9
dtype: int64

In [67]:
df.dtypes

age          int8
height    float16
weight      Int16
dtype: object

In [68]:
df.index.dtype

dtype('int64')

In [69]:
pd.Categorical([1, 3, 5, np.nan], ordered=True).min()

1

In [70]:
pd.Categorical([1, 3, 5, pd.NA], ordered=True).min()

1

In [77]:
data = io.StringIO(
"""
id,name
129237,Mary
123083,Lacey
123087,Bob
"""
)

In [72]:
df = pd.read_csv(
data,
dtype={'id': np.int32},
index_col=[0],
)

In [73]:
df

         name
id
129237   Mary
123083  Lacey
123087    Bob

In [74]:
df.memory_usage(deep=True)

Index     24
name     183
dtype: int64

In [75]:
df.dtypes

name    object
dtype: object

In [78]:
df = pd.read_csv(
data,
dtype={
'id': np.int32,
'name': pd.StringDtype()},
index_col=[0],
)
df

         name
id
129237   Mary
123083  Lacey
123087    Bob

In [79]:
df.memory_usage(deep=True)

Index     24
name     183
dtype: int64

In [80]:
df.dtypes

name    string
dtype: object

In [81]:
import pandas as pd
metadata = pd.Categorical(
['Mary'] * 100000 + ['Boby'] * 100000 + ['Joe'] * 100000
)
metadata.searchsorted(['Mary', 'Joe'])

array([300000, 200000], dtype=int64)

In [82]:
metadata

['Mary', 'Mary', 'Mary', 'Mary', 'Mary', ..., 'Joe', 'Joe', 'Joe', 'Joe', 'Joe']
Length: 300000
Categories (3, object): ['Boby', 'Joe', 'Mary']

In [2]:
df = pd.read_clipboard()
df

      A   B   C
0   3.0   3   2
1   2.0   1   5
2   8.0   6   8
3  99.0  99  15

In [3]:
results = [0]*len(df)
results

[0, 0, 0, 0]

In [4]:
for i,v in df.iterrows():
    results[i] = v.sum()
df['sum'] = results
df

      A   B   C    sum
0   3.0   3   2    8.0
1   2.0   1   5    8.0
2   8.0   6   8   22.0
3  99.0  99  15  213.0